{
  "school": "jakab hunor it-berufsfachschule",
  "teacher": "lehrer",
  "news": "nachricht",
  "page2": "gemeinschaft",
  "page1": "kurse",
  "page3": "beziehung",
  "default": "standard",
  "user": "benutzer",
  "users": "benutzer",
  "language": "sprache",
  "home_page": "Startseite",
  "title": "Willkommen auf der Website unserer Schule!",
  "page": "seite",
  "login": "anmeldung",
  "logout": "ausloggen",
  "register": "registrieren",
  "account": "konto",
  "profile": "profil",
  "informatics": "Informatik",
  "identifier": "kennung",
  "type": "typ",
  "administrator": "administrator",
  "guest": "gast",
  "vip": "vip",
  "not_verified": "nicht verifiziert",
  "name": "nahme",
  "prefix_name": "präfixname",
  "first_name": "vorname",
  "middle_name": "zweiter vorname",
  "last_name": "nachname",
  "suffix_name": "namenszusatz",
  "nickname": "spitzname",
  "born": "geboren",
  "gender": "geschlecht",
  "male": "männlich",
  "female": "weiblich",
  "image": "bild",
  "country": "land",
  "phone": "telefon",
  "city": "stadt",
  "postcode": "postleitzahl",
  "address": "anschrift",
  "email": "email",
  "confirmation": "bestätigung",
  "password": "passwort",
  "password_rule": "6–20 zeichen (enthält groß- und kleinbuchstaben und zahlen)",
  "display_password": "ein passwort anzeigen",
  "code": "code",
  "refresh": "aktualisierung",
  "save": "sparen",
  "cancel": "abbrechen",
  "edit": "bearbeiten",
  "forgot_password": "du hast dein passwort vergessen",
  "change_email": "Email adresse ändern",
  "change_password": "kennwort ändern",
  "under_construction": "bauarbeiten im gange",
  "gallery": "galerie",
  "slogan": "Wir bilden die Fachkräfte der Zukunft aus",
  "training1": "Design und Betrieb automatisierter Fahrzeuge",
  "training2": "Konzeption und Betrieb von Smart-Home-Systemen",
  "training3": "Design und Betrieb von Robotersystemen",
  "training4": "Kurs zur Entwicklung von Virtual Reality (VR) und Augmented Reality (AR).",
  "training5": "Entwicklung künstlicher Intelligenz und Datenanalyse",
  "training6": "Hauptfach Digitales Marketing und personalisiertes Marketing",
  "training1_description": "Das vielleicht wesentlichste Merkmal autonomer Fahrzeugfahrsysteme ist genau der Umgang mit der Mehrdeutigkeit und Komplexität teilweise wahrgenommener Verkehrssituationen mit Störungen. Jan Nagler, Jeroen van den Hoven und Dirk Helbing",
  "training2_description": "Das Smart Home ist ein logikbasiertes, koordiniertes System, bei dem die am System beteiligten Einheiten (Heizung, Beleuchtung, Beschattung etc.) zusammenarbeiten und sich gegenseitig unterstützen. Alle Funktionen sind über eine Oberfläche abrufbar und vernetzte Automatisierungen können nach Wunsch erstellt werden.",
  "training3_description": "Eine der wichtigsten Aufgaben der Robotik ist die möglichst effiziente Zusammenarbeit zwischen Mensch und Roboter. Durch die Fähigkeit, parallel mit Menschen zu arbeiten, können sich moderne Robotersysteme an die sich schnell ändernden Bedingungen anpassen.",
  "training4_description": "Eine große Rolle bei der Gestaltung des Virtuellen spielen die sogenannten Trackingsysteme, die zur Positionsbestimmung von Körper, Händen und Kopf des Nutzers erforderlich sind, sowie die taktilen Systeme, die Kraft- und Druckrückmeldungen liefern sollen Wirklichkeit.",
  "training5_description": "Künstliche Intelligenz stellt derzeit einen bedeutenden Zweig der Informatik dar, der sich mit intelligentem Verhalten, maschinellem Lernen und maschineller Anpassung beschäftigt. Es ist zu einer Disziplin geworden, die versucht, Antworten auf reale Probleme zu geben.",
  "training6_description": "Der Zweck des digitalen Marketings besteht darin, dem Verkäufer die Möglichkeit zu geben, mit persönlicheren Methoden die Bekanntheit/Bekanntheit seines Unternehmens oder Geschäfts aufzubauen und so eine stärker auf den Menschen ausgerichtete Kommunikation zu schaffen.",
  "purpose": "Das Ziel unserer Schule ist es, unseren Schülern Wissen zu vermitteln, das der heutigen, sich schnell verändernden Welt entspricht. Wir beobachten ständig Trends und passen unsere Schulungen entsprechend an und entwickeln sie weiter.",
  "in_more_detail": "ausführlicher",
  "course": "wesentlich",
  "back": "zurück",
  "home_title": "Die erfolgreichste IT-Schule der letzten Jahre!",
  "homenews": "Neueste Nachrichten:",
  "homenews_1_title": "Die Quote der direkten Übernahme nach der Ausbildung liegt bei über 95 %!",
  "homenews_1_desc" : "Das vorangegangene Studienjahr endete mit einem beispiellosen Erfolg, fast alle unserer Studierenden waren nach Abschluss der Ausbildung im Beruf beschäftigt.",
  "homenews_2_title": "Unser Student ist dieses Jahr der „Best of Profession“!",
  "homenews_2_desc" : "Kornél Kovács gewann den diesjährigen Best in Profession Award. Der Schüler unserer Schule setzte sich mit großem Vorsprung gegen seine Konkurrenten durch.",
  "homenews_3_title": "Wir adoptierten Sanyi, einen Waschbären aus dem örtlichen Zoo",
  "homenews_3_desc" : "Sanyi ist eine sehr freundliche Waschbärin, sie hat Spaß mit unseren Schülern, wenn wir sie besuchen.",
  "homenews_4_title": "Die Renovierung der Schulhalle wird im März beginnen",
  "homenews_4_desc" : "Im Frühjahr ist der Zutritt durch den Haupteingang für knapp 2 Wochen gesperrt, der Zutritt zu unserer Schule ist während der Renovierungsarbeiten über den Hintereingang möglich.",
  "homenews_bottom" : "Weitere Neuigkeiten folgen in Kürze..."
}