{
  "school": "jakab hunor it-berufsfachschule",
  "teacher": "lehrer",
  "news": "nachricht",
  "community": "gemeinschaft",
  "courses": "kurse",
  "contact": "beziehung",
  "default": "standard",
  "user": "benutzer",
  "users": "benutzer",
  "language": "sprache",
  "home_page": "Startseite",
  "title": "Willkommen auf der Website unserer Schule!",
  "page": "seite",
  "login": "anmeldung",
  "logout": "ausloggen",
  "register": "registrieren",
  "account": "konto",
  "profile": "profil",
  "informatics": "Informatik",
  "identifier": "kennung",
  "type": "typ",
  "administrator": "administrator",
  "guest": "gast",
  "vip": "vip",
  "not_verified": "nicht verifiziert",
  "name": "nahme",
  "prefix_name": "präfixname",
  "first_name": "vorname",
  "middle_name": "zweiter vorname",
  "last_name": "nachname",
  "suffix_name": "namenszusatz",
  "nickname": "spitzname",
  "born": "geboren",
  "gender": "geschlecht",
  "male": "männlich",
  "female": "weiblich",
  "image": "bild",
  "country": "land",
  "phone": "telefon",
  "city": "stadt",
  "postcode": "postleitzahl",
  "address": "anschrift",
  "email": "email",
  "confirmation": "bestätigung",
  "password": "passwort",
  "password_rule": "6–20 zeichen (enthält groß- und kleinbuchstaben und zahlen)",
  "display_password": "ein passwort anzeigen",
  "code": "code",
  "refresh": "aktualisierung",
  "save": "sparen",
  "cancel": "abbrechen",
  "edit": "bearbeiten",
  "forgot_password": "du hast dein passwort vergessen",
  "change_email": "Email adresse ändern",
  "change_password": "kennwort ändern",
  "under_construction": "bauarbeiten im gange",
  "gallery": "galerie",
  "slogan": "Wir bilden die Fachkräfte der Zukunft aus",
  "courses1": "Design und Betrieb automatisierter Fahrzeuge",
  "courses2": "Konzeption und Betrieb von Smart-Home-Systemen",
  "courses3": "Design und Betrieb von Robotersystemen",
  "courses4": "Kurs zur Entwicklung von Virtual Reality (VR) und Augmented Reality (AR).",
  "courses5": "Entwicklung künstlicher Intelligenz und Datenanalyse",
  "courses6": "Hauptfach Digitales Marketing und personalisiertes Marketing",
  "courses1_description": "Das vielleicht wesentlichste Merkmal autonomer Fahrzeugfahrsysteme ist genau der Umgang mit der Mehrdeutigkeit und Komplexität teilweise wahrgenommener Verkehrssituationen mit Störungen. Jan Nagler, Jeroen van den Hoven und Dirk Helbing",
  "courses2_description": "Das Smart Home ist ein logikbasiertes, koordiniertes System, bei dem die am System beteiligten Einheiten (Heizung, Beleuchtung, Beschattung etc.) zusammenarbeiten und sich gegenseitig unterstützen. Alle Funktionen sind über eine Oberfläche abrufbar und vernetzte Automatisierungen können nach Wunsch erstellt werden.",
  "courses3_description": "Eine der wichtigsten Aufgaben der Robotik ist die möglichst effiziente Zusammenarbeit zwischen Mensch und Roboter. Durch die Fähigkeit, parallel mit Menschen zu arbeiten, können sich moderne Robotersysteme an die sich schnell ändernden Bedingungen anpassen.",
  "courses4_description": "Eine große Rolle bei der Gestaltung des Virtuellen spielen die sogenannten Trackingsysteme, die zur Positionsbestimmung von Körper, Händen und Kopf des Nutzers erforderlich sind, sowie die taktilen Systeme, die Kraft- und Druckrückmeldungen liefern sollen Wirklichkeit.",
  "courses5_description": "Künstliche Intelligenz stellt derzeit einen bedeutenden Zweig der Informatik dar, der sich mit intelligentem Verhalten, maschinellem Lernen und maschineller Anpassung beschäftigt. Es ist zu einer Disziplin geworden, die versucht, Antworten auf reale Probleme zu geben.",
  "courses6_description": "Der Zweck des digitalen Marketings besteht darin, dem Verkäufer die Möglichkeit zu geben, mit persönlicheren Methoden die Bekanntheit/Bekanntheit seines Unternehmens oder Geschäfts aufzubauen und so eine stärker auf den Menschen ausgerichtete Kommunikation zu schaffen.",
  "purpose": "Das Ziel unserer Schule ist es, unseren Schülern Wissen zu vermitteln, das der heutigen, sich schnell verändernden Welt entspricht. Wir beobachten ständig Trends und passen unsere Schulungen entsprechend an und entwickeln sie weiter.",
  "in_more_detail": "ausführlicher",
  "course": "wesentlich",
  "back": "zurück",
  "home_title": "Die erfolgreichste IT-Schule der letzten Jahre!",
  "homenews": "Neueste Nachrichten:",
  "homenews_1_title": "Die Quote der direkten Übernahme nach der Ausbildung liegt bei über 95 %!",
  "homenews_1_desc" : "Das vorangegangene Studienjahr endete mit einem beispiellosen Erfolg, fast alle unserer Studierenden waren nach Abschluss der Ausbildung im Beruf beschäftigt.",
  "homenews_2_title": "Unser Student ist dieses Jahr der „Best of Profession“!",
  "homenews_2_desc" : "Kornél Kovács gewann den diesjährigen Best in Profession Award. Der Schüler unserer Schule setzte sich mit großem Vorsprung gegen seine Konkurrenten durch.",
  "homenews_3_title": "Wir adoptierten Sanyi, einen Waschbären aus dem örtlichen Zoo",
  "homenews_3_desc" : "Sanyi ist eine sehr freundliche Waschbärin, sie hat Spaß mit unseren Schülern, wenn wir sie besuchen.",
  "homenews_4_title": "Die Renovierung der Schulhalle wird im März beginnen",
  "homenews_4_desc" : "Im Frühjahr ist der Zutritt durch den Haupteingang für knapp 2 Wochen gesperrt, der Zutritt zu unserer Schule ist während der Renovierungsarbeiten über den Hintereingang möglich.",
  "homenews_bottom" : "Weitere Neuigkeiten folgen in Kürze...",
  "contact_title": "Eine Frage haben? Kontaktiere uns!",
  "contact_message": "Nachricht...",
  "contact_subject": "Betreff der Nachricht...",
  "contact_email": "Ihre E-Mail-Adresse...",
  "contact_submit": "Senden!",
  "community_title": "Ihre Karriere liegt in den Händen der besten Profis!",
  "community_title_desc": "Unsere Kolleginnen und Kollegen stehen Ihnen mit exzellentem Fachwissen und hervorragender Lehrkompetenz zur Verfügung. Bei uns ist der Erfolg garantiert!",
  "close": "Schließen",
  "community_1": "Unsere Lehrer spielen eine Schlüsselrolle bei der technologischen Entwicklung und den Innovationsfähigkeiten der Schüler. Solche Lehrer verfügen über die Kombination aus Fachwissen und Engagement, um ihre Schüler zu inspirieren und anzuleiten, sich effektiv in der digitalen Welt zurechtzufinden. Diese Lehrkräfte zeichnen sich nicht nur dadurch aus, dass sie informationstechnisches Wissen vermitteln, sondern auch die Kreativität und Problemlösungsfähigkeiten der Schüler fördern und so die allgemeine Wissensentwicklung fördern.",
  "community_2": "Ein exzellenter IT-Lehrer erzielt bei seinen Schülern in der Regel hervorragende Ergebnisse. Solche Lehrkräfte erkennen, dass Lernen und Lehren im digitalen Zeitalter dynamisch sein müssen und passen ihren Unterricht entsprechend an. Auf diese Weise gelingt es ihnen, die Anerkennung und Unterstützung ihrer Studierenden zu gewinnen. Zu den erzielten Ergebnissen können herausragende Leistungen bei Robotik-Wettbewerben, Programmier-Challenges oder sogar die innovativen Projekte gehören, denen sie geholfen haben. Diese Ergebnisse spiegeln nicht nur das Fachwissen der Lehrkräfte wider, sondern auch die Entwicklung der Talente der von ihnen unterrichteten Schüler.",
  "community_3": "Unsere Lehrkräfte an unserer Schule erbringen nicht nur herausragende Leistungen im Unterricht, sondern tragen auch als Teil der Berufsgemeinschaft zur Weiterentwicklung der Disziplin bei. Solche Lehrer nehmen häufig an Konferenzen und Workshops teil und tauschen ihre Erfahrungen aktiv mit anderen Fachleuten aus. Dadurch tragen sie zum Fortschritt von Bildung und technologischer Entwicklung auf globaler Ebene bei und geben Inspiration für die nächste Generation.",
  "comm_tab_title": "Ihre sich weiterentwickelnde Karriere ist in den besten Händen!",
  "instructor": "Ausbilder",
  "subjects1": "Design und Entwicklung von autonomen Fahrzeugen",
  "subjects2": "Robotik und Softwareentwicklung für Fahrzeuge",
  "subjects3": "Fahrzeugbetrieb und Flottenmanagement",
  "subjects4": "Künstliche Intelligenz und maschinelles Lernen in Fahrzeuganwendungen",
  "subjects5": "Fahrzeugsicherheit und rechtliche Fragen im Bereich der selbstfahrenden Fahrzeuge",
  "subjects6": "Grundlagen der Smart-Home-Technologien",
  "subjects7": "Intelligente Netze und Kommunikation",
  "subjects8": "Entwurf und Integration eines intelligenten Heimsystems",
  "subjects9": "Automatisierte Haussicherheit",
  "subjects10": "Smart Home Management und Energieeffizienz",
  "subjects11": "Grundlagen der Robotik",
  "subjects12": "Robotik Hardware-Design und Elektronik",
  "subjects13": "Roboterprogrammierung und -steuerung",
  "subjects14": "Künstliche Intelligenz in der Robotik",
  "subjects15": "Robotik-Anwendungen und Entwicklung",
  "subjects16": "Grundlagen von Virtual Reality und Augmented Reality",
  "subjects17": "3D-Modellierung und Animation",
  "subjects18": "VR- und AR-Programmierung",
  "subjects19": "User Experience Design in VR und AR",
  "subjects20": "VR- und AR-Anwendungen in Gesundheit und Bildung",
  "subjects21": "Grundlagen des maschinellen Lernens",
  "subjects22": "Deep Learning und neuronale Netze",
  "subjects23": "Data Mining und Datenanalyse",
  "subjects24": "Anwendungen der künstlichen Intelligenz",
  "subjects25": "Ethische und rechtliche Aspekte der künstlichen Intelligenz",
  "subjects26": "Online-Marketing-Strategien und -Kampagnen",
  "subjects27": "Datengesteuertes Marketing und Analytik",
  "subjects28": "Personalisiertes Marketing und CRM",
  "subjects29": "Marketing für soziale Medien",
  "subjects30": "Innovation und neue Technologien im digitalen Marketing",
  "subjects1_description": "In diesem Kurs lernen die Studierenden die Grundsätze und praktischen Anwendungen der Entwicklung selbstfahrender Fahrzeugtechnologie kennen.",
  "subjects2_description": "In diesem Fach werden Fähigkeiten vermittelt, die es den Studierenden ermöglichen, Software und Algorithmen für Fahrzeuge zu entwerfen und zu entwickeln.",
  "subjects3_description": "Ennek a tantárgynak a keretében a diákok megismerik az önvezető járművek flottájának hatékony üzemeltetését és karbantartását.",
  "subjects4_description": "In diesem Fach werden Anwendungen des maschinellen Lernens und der künstlichen Intelligenz in der Automobilindustrie gelehrt, z. B. bei der Entwicklung von selbstfahrenden Autos.",
  "subjects5_description": "Ziel dieses Themas ist es, die Sicherheit von Fahrzeugen und die rechtlichen Aspekte von selbstfahrenden Fahrzeugen zu verstehen und zu analysieren.",
  "subjects6_description": "Dieser Kurs führt in die Grundlagen von Smart-Home-Systemen ein, darunter IoT-Geräte (Internet der Dinge), Sensoren und Steuerungssysteme.",
  "subjects7_description": "Ziel dieses Kurses ist es, Kommunikationsnetzwerke zwischen Smart Home-Geräten zu entwerfen und zu konfigurieren.",
  "subjects8_description": "Dieser Kurs konzentriert sich auf praktische Aspekte, wie z. B. die Entwicklung und Integration verschiedener Smart Home-Geräte in ein komplexes System.",
  "subjects9_description": "Dieser Kurs befasst sich mit Haussicherheitssystemen und damit verbundenen intelligenten Lösungen.",
  "subjects10_description": "Dieser Kurs befasst sich mit Energieeffizienz und Energiemanagement in intelligenten Häusern und zeigt, welche Technologien zur Optimierung des Energieverbrauchs eingesetzt werden können.",
  "subjects11_description": "Dieser Kurs führt die Studierenden in die grundlegenden Konzepte, die Geschichte und die technologischen Grundlagen der Robotik ein.",
  "subjects12_description": "Dieser Kurs befasst sich mit den Hardwarekomponenten von Robotersystemen und lehrt die Studenten, Roboter zu entwerfen und zu bauen.",
  "subjects13_description": "Dieser Kurs behandelt die theoretischen und praktischen Aspekte der Roboterprogrammierung und -steuerung.",
  "subjects14_description": "Dieser Kurs zeigt, wie künstliche Intelligenz in der Robotik eingesetzt werden kann, z. B. durch den Einsatz von maschinellem Lernen und künstlichen neuronalen Netzen.",
  "subjects15_description": "Dieses Fach befasst sich mit verschiedenen Anwendungen der Robotik, wie z. B. Industrieroboter, selbstfahrende Fahrzeuge und Robotik im Gesundheitswesen.",
  "subjects16_description": "Dieser Kurs behandelt die grundlegenden Konzepte und Prinzipien von VR- und AR-Technologien und führt in die Techniken und Werkzeuge ein, die von Entwicklern in diesem Bereich verwendet werden.",
  "subjects17_description": "Dieser Kurs befasst sich mit dreidimensionalen Modellierungs- und Animationstechniken, die für die Erstellung von VR- und AR-Inhalten unerlässlich sind.",
  "subjects18_description": "Dieser Kurs konzentriert sich auf die Entwicklung von VR- und AR-Anwendungen und führt in die Programmiersprachen und Plattformen ein, mit denen Entwickler arbeiten müssen.",
  "subjects19_description": "Dieser Kurs konzentriert sich auf die Gestaltung der Benutzererfahrung (UX) in Virtual-Reality- und Augmented-Reality-Anwendungen, einschließlich Interaktionsdesign und Gestaltung der Benutzeroberfläche.",
  "subjects20_description": "In diesem Kurs werden VR- und AR-Anwendungen in den Bereichen Gesundheit und Bildung vorgestellt und es wird erläutert, wie diese Technologien für pädagogische und therapeutische Zwecke eingesetzt werden können.",
  "subjects21_description": "Dieser Kurs führt die Studierenden in die Grundlagen des maschinellen Lernens ein, einschließlich überwachtem und unüberwachtem Unterricht, Modellierung und Lernalgorithmen.",
  "subjects22_description": "Dieser Kurs befasst sich mit der Theorie und den Anwendungen von Deep Learning und neuronalen Netzen und führt in Faltungsnetze und rekurrente Netze ein.",
  "subjects23_description": "In diesem Kurs werden Techniken vermittelt, die Ihnen bei der Analyse von Daten helfen, wie z. B. Segmentierung, Klassifizierung und Clustering.",
  "subjects24_description": "Dieser Kurs konzentriert sich auf die Anwendungen von KI in verschiedenen Branchen wie dem Gesundheitswesen, der Automobilindustrie und dem Finanzwesen.",
  "subjects25_description": "Dieser Kurs befasst sich mit den ethischen und rechtlichen Aspekten der künstlichen Intelligenz und des maschinellen Lernens, wie z. B. Fragen des Datenschutzes und der Diskriminierung.",
  "subjects26_description": "In diesem Kurs lernen die Teilnehmer, wie sie Online-Marketingstrategien und -kampagnen planen und umsetzen können, einschließlich Suchmaschinenoptimierung (SEO), bezahlte Werbung (PPC) und soziale Medien.",
  "subjects27_description": "In diesem Kurs werden die Grundsätze des datengesteuerten Marketings und der Einsatz von Marketinganalysen für die Entscheidungsfindung und die Messung der Wirksamkeit von Kampagnen vorgestellt.",
  "subjects28_description": "Die Studierenden lernen, wie sie personalisierte Marketingstrategien anwenden und Customer Relationship Management (CRM)-Systeme zur Verbesserung der Kundenbeziehungen nutzen können.",
  "subjects29_description": " Dieser Kurs konzentriert sich auf die verschiedenen Social-Media-Plattformen (z. B. Facebook, Instagram, Twitter) und deren effektive Nutzung im Rahmen von Marketingkampagnen.",
  "subjects30_description": "In diesem Kurs werden neue technologische Trends und Innovationen im digitalen Marketing vorgestellt, wie künstliche Intelligenz, maschinelles Lernen und AR/VR-Anwendungen.",
  "teachers1_content": "Hallo! Ich bin Attila Pataki, und ich freue mich darauf, Sie durch die aufregende Welt der autonomen Fahrzeuge zu führen. Ich teile mit Ihnen mein Wissen über Fahrzeugbetrieb und Flottenmanagement sowie über Fahrzeuganwendungen mit künstlicher Intelligenz und maschinellem Lernen. Mein Ziel ist es, Ihnen dabei zu helfen, Ihr Wissen in diesen Bereichen zu erweitern und Sie auf die verkehrs- und technologiepolitischen Herausforderungen der Zukunft vorzubereiten. Kommen Sie und lassen Sie uns gemeinsam die neuen Dimensionen der Fahrzeugentwicklung erkunden!",
  "teachers2_content": "Hallo! Ich bin Adél Dudás und wir erkunden mit Ihnen die spannende Welt der Robotik und der Softwareentwicklung speziell für Fahrzeuge. Ich teile mein Wissen mit euch in den Fächern Grundlagen der Robotik, Hardwaredesign und Elektronik der Robotik sowie Roboterprogrammierung und -steuerung. Mein Ziel ist es, Sie zu inspirieren und Ihnen zu helfen, die Fähigkeiten zu entwickeln, die Sie in diesem dynamischen Bereich benötigen. Kommen Sie und tauchen Sie ein in die magische Welt der Robotik, in der Maschinen durch Softwareentwicklung und technische Kreativität zum Leben erweckt werden!",
  "teachers3_content": "Hallo! Ich bin Albert Horváth, und ich begleite Sie auf einer Tour durch die faszinierende Welt der virtuellen und erweiterten Realität. In den Kursen 3D-Modellierung und Animation sowie VR- und AR-Programmierung helfe ich Ihnen, die erstaunliche Welt der digitalen Abbildung und Programmierung zu erkunden. Mein Ziel ist es, Sie zu inspirieren und Ihre Kreativität zu fördern, während wir gemeinsam die Grundlagen der virtuellen und erweiterten Realität erforschen. Kommen Sie und lassen Sie uns gemeinsam die digitalen Erlebnisse der Zukunft schaffen!",
  "teachers4_content": "Hallo! Ich bin Attila Borbély, und ich freue mich sehr, hier bei Ihnen in der IT-Schule zu sein. Für mich sind intelligente Netzwerke und Kommunikation nicht nur ein Fach, sondern eine Leidenschaft. Ich widme mich auch dem Design und der Integration von Smart Home Systemen. Mein Ziel ist es, Sie zu inspirieren und Ihnen zu helfen, sich auf die spannende und dynamische Welt der IT vorzubereiten.",
  "teachers5_content": "Hallo! Ich bin Gábor Varga, und ich bin hier, um mit Ihnen in die faszinierende Welt des maschinellen Lernens einzutauchen. In den Kursen Grundlagen des maschinellen Lernens, Deep Learning und Neuronale Netze, Data Mining und Datenanalyse sowie Anwendungen der Künstlichen Intelligenz helfe ich Ihnen, die Geheimnisse intelligenter Technologien und Datenanalyse zu erforschen. Mein Ziel ist es, Sie zu inspirieren und Ihnen dabei zu helfen, die Fähigkeiten zu entwickeln, die Sie im Bereich der Künstlichen Intelligenz brauchen werden. Kommen Sie und lassen Sie uns gemeinsam die Herausforderungen der Zukunft angehen!",
  "teachers6_content": "Hallo zusammen! Ich bin Dr. Zsolt Molnár, und ich bin hier, um mit Ihnen über Fahrzeugsicherheit und rechtliche Fragen im Bereich der selbstfahrenden Fahrzeuge zu diskutieren. In der Veranstaltung Ethics and Legal Aspects of Artificial Intelligence werde ich Ihnen helfen, den verantwortungsvollen und ethischen Einsatz von KI zu erkunden. Mein Ziel ist es, Ihnen nicht nur theoretisches Wissen zu vermitteln, sondern Sie auch auf die realen Herausforderungen vorzubereiten, mit denen Sie im Bereich der selbstfahrenden Fahrzeuge und der KI konfrontiert werden könnten. Nehmen Sie an der Diskussion teil, die die Zukunft der Mobilität und der technologischen Entwicklung prägen wird!",
  "teachers7_content": "Hallo! Ich bin László Nagy, und ich bin hier, um mit Ihnen die aufregende Welt der Smart Home-Technologie zu erkunden. In den Kursen Smart Home Technologies Basics, Automated Home Safety and Security und Smart Home Management and Energy Efficiency werde ich Ihnen helfen, die neuesten Trends in Sachen Automatisierung und Energieeffizienz im modernen Zuhause zu entdecken. Mein Ziel ist es, Ihnen Wissen zu vermitteln, das Ihnen hilft, ein intelligentes und nachhaltiges Zuhause zu gestalten und zu verwalten. Kommen Sie und lassen Sie uns gemeinsam die Zukunft des Wohnens gestalten!",
  "teachers8_content": "Hallo! Ich bin Andrea Kovács und ich führe Sie durch die anspruchsvolle Welt des Online-Marketings. In den Kursen Online-Marketing-Strategien und -Kampagnen, Datengesteuertes Marketing und Analytik sowie Personalisiertes Marketing und CRM helfe ich Ihnen, die Bedeutung digitaler Marketing-Tools und datengesteuerter Strategien zu verstehen. Mein Ziel ist es, Sie darauf vorzubereiten, erfolgreiches Marketing im digitalen Raum zu planen und durchzuführen. Kommen Sie und lassen Sie uns gemeinsam die dynamische und vielfältige Welt des Marketings erkunden!",
  "teachers9_content": "Hallo! Ich bin Dr. Gábor Barta und möchte mein Wissen über Künstliche Intelligenz in der Robotik und Robotikanwendungen und -entwicklung mit Ihnen teilen. Die Welt der KI und der Robotik ist für mich nicht nur ein Thema, sondern eine Lebenseinstellung. Mein Ziel ist es, Ihnen zu helfen, die Geheimnisse dieser spannenden Bereiche zu erforschen und Sie in der Welt der Entwicklung und Anwendungen zu inspirieren.",
  "teachers10_content": "Hallo! Ich bin Éva Mészáros, und wir tauchen mit Ihnen in das spannende Feld des Social Media Marketings ein. Im Kurs Innovation und neue Technologien im digitalen Marketing werde ich Sie mit den neuesten Trends und Methoden vertraut machen. Mein Ziel ist es, Sie auf die dynamische Welt des digitalen Marketings vorzubereiten, mit besonderem Fokus auf Social Media Strategien und Innovationen. Kommen Sie und lassen Sie uns gemeinsam entdecken, wie man im digitalen Marketing effektiv und kreativ sein kann!",
  "teachers11_content": "Hallo! Ich bin Péter Szabó, und gemeinsam mit Ihnen erforschen wir die Anwendungen von Virtual und Augmented Reality im Gesundheits- und Bildungswesen. Im Kurs VR- und AR-Anwendungen im Gesundheits- und Bildungswesen werde ich Ihnen helfen, die Grenzen der technologischen Innovation in diesen Schlüsselbereichen zu erkunden. Mein Ziel ist es, Sie zu inspirieren und Ihnen zu helfen, kreative und effektive Lösungen in diesem dynamischen und sich entwickelnden Bereich zu entwickeln. Kommen Sie und lassen Sie uns gemeinsam an der Zukunft des Gesundheits- und Bildungswesens teilhaben!"
}