{
  "school": "jakab hunor it school",
  "teacher": "teachers",
  "news": "news",
  "community": "community",
  "courses": "Courses",
  "contact": "contact us",
  "default": "default",
  "user": "user",
  "users": "users",
  "language": "language",
  "home_page": "home page",
  "title": "Welcome to the website of our school!",
  "page": "page",
  "login": "login",
  "logout": "logout",
  "register": "register",
  "account": "account",
  "profile": "profile",
  "informatics": "informatics",
  "identifier": "identifier",
  "type": "type",
  "administrator": "administrator",
  "guest": "guest",
  "vip": "vip",
  "not_verified": "not verified",
  "name": "name",
  "prefix_name": "prefix name",
  "first_name": "first name",
  "middle_name": "middle name",
  "last_name": "last name",
  "suffix_name": "suffix name",
  "nickname": "nickname",
  "born": "born",
  "gender": "gender",
  "male": "male",
  "female": "female",
  "image": "image",
  "country": "country",
  "phone": "phone",
  "city": "city",
  "postcode": "postcode",
  "address": "address",
  "email": "email",
  "confirmation": "confirmation",
  "password": "password",
  "password_rule": "6-20 characters (contains uppercase, lowercase letters and numbers)",
  "display_password": "display a password",
  "code": "code",
  "refresh": "refresh",
  "save": "save",
  "cancel": "cancel",
  "edit": "edit",
  "forgot_password": "forgot your password",
  "change_email": "change email address",
  "change_password": "change password",
  "under_construction": "under construction",
  "gallery": "gallery",
  "slogan": "We train the professionals of the future",
  "training1": "Design and operation of automated vehicles",
  "training2": "Design and operation of smart home systems",
  "training3": "Design and operation of robotic systems",
  "training4": "Virtual reality (VR) and augmented reality (AR) development course",
  "training5": "Development of artificial intelligence and data analysis",
  "training6": "Digital marketing and personalized marketing major",
  "training1_description": "Perhaps the most essential feature of autonomous vehicle driving systems is precisely how they handle the ambiguity and complexity of partially perceived traffic situations with disturbances. Jan Nagler, Jeroen van den Hoven and Dirk Helbing",
  "training2_description": "The smart home is a logic-based, coordinated system where the units participating in the system (heating, lighting, shading, etc.) work together and support each other. All functions can be accessed from one interface, and connected automations can be created as desired.",
  "training3_description": "One of the most important endeavors of robotics is the most efficient cooperation between humans and robots. With the ability to work in parallel with humans, modern robotic systems can adapt to the most rapidly changing conditions.",
  "training4_description": "The so-called tracking systems, which are needed to determine the position of the user's body, hands, and head, as well as the tactile systems, which are designed to provide force and pressure feedback, play a huge role in the creation of virtual reality.",
  "training5_description": "Artificial intelligence currently represents a significant branch of computer science that deals with intelligent behavior, machine learning, and machine adaptation. It has become a discipline that tries to provide answers to real-life problems.",
  "training6_description": "The purpose of digital marketing is for the seller to have the opportunity to use more personal methods to build up the recognition/awareness of his company or business, and thus create a more human-centered communication.",
  "purpose": "The goal of our school is to provide our students with knowledge that corresponds to today's rapidly changing world. We constantly monitor trends and adapt and develop our training courses accordingly.",
  "in_more_detail": "in more detail",
  "course": "course",
  "back": "back",
  "home_title": "The most successful IT school in recent years!",
  "homenews": "Recent news:",
  "homenews_1_title": "The rate of immediate employment after training is over 95%!",
  "homenews_1_desc" : "The previous academic year ended with unprecedented success, almost all of our students were employed in the profession at the end of the training.",
  "homenews_2_title": "Our student is this year's -Best of profession!-",
  "homenews_2_desc" : "Kornél Kovács won this year's Best in Profession award. The student of our school defeated his competitors with a huge advantage.",
  "homenews_3_title": "We adopted Sanyi, a raccoon from the local zoo",
  "homenews_3_desc" : "Sanyi is a very friendly raccoon, he has fun with our students when we visit him.",
  "homenews_4_title": "The renovation of the school's hall will start in March",
  "homenews_4_desc" : "In the spring, entry through the main entrance is suspended for almost 2 weeks, and it will be possible to enter our school through the back entrance during the renovation.",
  "homenews_bottom" : "More news coming soon...",
  "contact_title": "Have a question? Contact us!",
  "contact_message": "Message...",
  "contact_subject": "Subject...",
  "contact_email": "Your e-mail...",
  "contact_submit": "Submit!",
  "community_title": "Your career is in the hands of the best professionals!",
  "community_title_desc": "Our colleagues are at your disposal with excellent professional knowledge and excellent teaching skills. With us, success is guaranteed!"
}