{
  "school": "jakab hunor it school",
  "teacher": "teachers",
  "news": "news",
  "introduction": "introduction",
  "community": "community",
  "courses": "Courses",
  "contact": "contact us",
  "default": "default",
  "user": "user",
  "users": "users",
  "language": "language",
  "home_page": "home page",
  "title": "Welcome to the website of our school!",
  "page": "page",
  "login": "login",
  "logout": "logout",
  "register": "register",
  "account": "account",
  "profile": "profile",
  "informatics": "informatics",
  "identifier": "identifier",
  "type": "type",
  "administrator": "administrator",
  "guest": "guest",
  "vip": "vip",
  "not_verified": "not verified",
  "name": "name",
  "prefix_name": "prefix name",
  "first_name": "first name",
  "middle_name": "middle name",
  "last_name": "last name",
  "suffix_name": "suffix name",
  "nickname": "nickname",
  "born": "born",
  "gender": "gender",
  "male": "male",
  "female": "female",
  "image": "image",
  "country": "country",
  "phone": "phone",
  "city": "city",
  "postcode": "postcode",
  "address": "address",
  "email": "email",
  "confirmation": "confirmation",
  "password": "password",
  "password_rule": "6-20 characters (contains uppercase, lowercase letters and numbers)",
  "display_password": "display a password",
  "code": "code",
  "refresh": "refresh",
  "save": "save",
  "cancel": "cancel",
  "edit": "edit",
  "forgot_password": "forgot your password",
  "change_email": "change email address",
  "change_password": "change password",
  "under_construction": "under construction",
  "gallery": "gallery",
  "slogan": "We train the professionals of the future",
  "courses1": "Design and operation of automated vehicles",
  "courses2": "Design and operation of smart home systems",
  "courses3": "Design and operation of robotic systems",
  "courses4": "Virtual reality (VR) and augmented reality (AR) development course",
  "courses5": "Development of artificial intelligence and data analysis",
  "courses6": "Digital marketing and personalized marketing major",
  "courses1_description": "Perhaps the most essential feature of autonomous vehicle driving systems is precisely how they handle the ambiguity and complexity of partially perceived traffic situations with disturbances. Jan Nagler, Jeroen van den Hoven and Dirk Helbing",
  "courses2_description": "The smart home is a logic-based, coordinated system where the units participating in the system (heating, lighting, shading, etc.) work together and support each other. All functions can be accessed from one interface, and connected automations can be created as desired.",
  "courses3_description": "One of the most important endeavors of robotics is the most efficient cooperation between humans and robots. With the ability to work in parallel with humans, modern robotic systems can adapt to the most rapidly changing conditions.",
  "courses4_description": "The so-called tracking systems, which are needed to determine the position of the user's body, hands, and head, as well as the tactile systems, which are designed to provide force and pressure feedback, play a huge role in the creation of virtual reality.",
  "courses5_description": "Artificial intelligence currently represents a significant branch of computer science that deals with intelligent behavior, machine learning, and machine adaptation. It has become a discipline that tries to provide answers to real-life problems.",
  "courses6_description": "The purpose of digital marketing is for the seller to have the opportunity to use more personal methods to build up the recognition/awareness of his company or business, and thus create a more human-centered communication.",
  "purpose": "The goal of our school is to provide our students with knowledge that corresponds to today's rapidly changing world. We constantly monitor trends and adapt and develop our training courses accordingly.",
  "in_more_detail": "in more detail",
  "course": "course",
  "back": "back",
  "home_title": "The most successful IT school in recent years!",
  "homenews": "Recent news:",
  "homenews_1_title": "The rate of immediate employment after training is over 95%!",
  "homenews_1_desc" : "The previous academic year ended with unprecedented success, almost all of our students were employed in the profession at the end of the training.",
  "homenews_2_title": "Our student is this year's -Best of profession!-",
  "homenews_2_desc" : "Kornél Kovács won this year's Best in Profession award. The student of our school defeated his competitors with a huge advantage.",
  "homenews_3_title": "We adopted Sanyi, a raccoon from the local zoo",
  "homenews_3_desc" : "Sanyi is a very friendly raccoon, he has fun with our students when we visit him.",
  "homenews_4_title": "The renovation of the school's hall will start in March",
  "homenews_4_desc" : "In the spring, entry through the main entrance is suspended for almost 2 weeks, and it will be possible to enter our school through the back entrance during the renovation.",
  "homenews_bottom" : "More news coming soon...",
  "introduction_title": "Introduction",
  "introduction_1_desc": "The Jakab Hunor Informatics Vocational School, which was founded in 1995, proudly carries its commitment to innovation and technology.",
  "introduction_2_desc": "Over the decades, the school has not only accumulated expert knowledge and experience, but is also at the forefront of the digital future.",
  "introduction_3_desc": "Our school offers excellent majors such as Design and Operation of Automated Vehicles, Design and Operation of Smart Home Systems, Design and Operation of Robotic Systems, Virtual Reality (VR) and Augmented Reality (AR) Developer, Artificial Intelligence Development and Data Analysis, as well as Digital Marketing and personalized marketing, ensure that our students have the most up-to-date knowledge and practical skills.",
  "introduction_4_desc": "Choose the Jakab Hunor IT Technical School, where traditions and development meet, and get ready for the challenges of the digital world!",
  "contact_title": "Have a question? Contact us!",
  "contact_message": "Message...",
  "contact_subject": "Subject...",
  "contact_email": "Your e-mail...",
  "contact_submit": "Submit!",
  "community_title": "Your career is in the hands of the best professionals!",
  "community_title_desc": "Our colleagues are at your disposal with excellent professional knowledge and excellent teaching skills. With us, success is guaranteed!",
  "close": "Close",
  "community_1": "Our teachers play a key role in students' technological development and innovation skills. Such teachers have the combination of expertise and commitment to inspire and guide their students to effectively navigate the digital world. These teachers excel not only in imparting information technology knowledge, but also by encouraging students' creativity and problem-solving abilities, thus promoting overall development in the field of knowledge.",
  "community_2": "An excellent IT teacher usually achieves outstanding results among his students. Such teachers recognize that learning and teaching in the digital age must be dynamic and adapt their lessons accordingly. In this way, they manage to win the recognition and support of their students. Among the results achieved can be outstanding achievements in robotics competitions, programming challenges or even the innovative projects they helped. These results reflect not only the professional knowledge of the teachers, but also the development of the talents of the students they teach.",
  "community_3": "Our teachers at our school not only provide outstanding performance in the classroom, but also contribute to the development of the discipline as part of the professional community. Such teachers often participate in conferences, workshops and actively share their experiences with other professionals. Through this, they contribute to the advancement of education and technological development on a global scale and provide inspiration for the next generation.",
  "comm_tab_title": "Your developing career is in the best possible hands!",
  "instructor": "Instructor",
  "subjects1": "Design and development of autonomous vehicles",
  "subjects2": "Robotics and software development for vehicles",
  "subjects3": "Vehicle operation and fleet management",
  "subjects4": "Artificial intelligence and machine learning in vehicle applications",
  "subjects5": "Vehicle safety and legal issues in the field of self-driving vehicles",
  "subjects6": "Basics of Smart Home Technologies",
  "subjects7": "Smart Grids and Communication",
  "subjects8": "Smart Home System Design and Integration",
  "subjects9": "Automated Home Security and Protection",
  "subjects10": "Smart Home Management and Energy Efficiency",
  "subjects11": "Robotics Basics",
  "subjects12": "Robotics Hardware Design and Electronics",
  "subjects13": "Robot programming and control",
  "subjects14": "Artificial Intelligence in Robotics",
  "subjects15": "Robotics Applications and Development",
  "subjects16": "Basics of Virtual Reality and Augmented Reality",
  "subjects17": "3D Modelling and Animation",
  "subjects18": "VR and AR Programming",
  "subjects19": "User Experience Design in VR and AR",
  "subjects20": "VR and AR applications in Health and Education",
  "subjects21": "Machine Learning Basics",
  "subjects22": "Deep Learning and Neural Networks",
  "subjects23": "Data Mining and Data Analysis",
  "subjects24": "Artificial Intelligence applications",
  "subjects25": "Ethical and Legal Aspects of Artificial Intelligence",
  "subjects26": "Online Marketing Strategies and Campaigns",
  "subjects27": "Data Driven Marketing and Analytics",
  "subjects28": "Personalised Marketing and CRM",
  "subjects29": "Social Media Marketing",
  "subjects30": "Innovation and New Technologies in Digital Marketing",
  "subjects1_description": "In this course, students will learn the principles and practical applications of self-driving vehicle technology design.",
  "subjects2_description": "This subject teaches skills that will enable students to design and develop software and algorithms for vehicles.",
  "subjects3_description": "In this course, students will learn about the efficient operation and maintenance of a fleet of self-driving vehicles.",
  "subjects4_description": "This subject teaches applications of machine learning and artificial intelligence in the automotive industry, for example in the development of self-driving cars.",
  "subjects5_description": "The aim of this subject is to understand and analyse vehicle safety and the legal aspects of self-driving vehicles.",
  "subjects6_description": "This course introduces the basics of smart home systems, including IoT (Internet of Things) devices, sensors and control systems.",
  "subjects7_description": "The aim of this course is to design and configure communication networks between smart home devices.",
  "subjects8_description": "This course focuses on practical aspects such as how to design and integrate different smart home devices into a complex system.",
  "subjects9_description": "This course covers home security systems and related smart solutions.",
  "subjects10_description": "This course deals with the energy efficiency and energy management of smart homes, showing the technologies that can be used to optimise energy use.",
  "subjects11_description": "This course introduces students to the basic concepts, history and technological foundations of robotics.",
  "subjects12_description": "This course covers the hardware components of robotic systems and teaches students to design and build robots.",
  "subjects13_description": "This course covers the theoretical and practical aspects of robot programming and control.",
  "subjects14_description": "This course shows how artificial intelligence can be used in robotics, for example through machine learning and artificial neural networks.",
  "subjects15_description": "This subject deals with different applications of robotics, such as industrial robots, self-driving vehicles and robotics in healthcare.",
  "subjects16_description": "This course covers the basic concepts and working principles of VR and AR technologies, introducing the techniques and tools used by developers in this field.",
  "subjects17_description": "This course deals with three-dimensional modelling and animation techniques that are essential for the creation of VR and AR content.",
  "subjects18_description": "This course focuses on the development of VR and AR applications, introducing the programming languages and platforms that developers need to work with.",
  "subjects19_description": "This course focuses on user experience (UX) design in virtual reality and augmented reality applications, including interaction design and user interface design.",
  "subjects20_description": "This course introduces VR and AR applications in health and education and how these technologies can be used for educational and therapeutic purposes.",
  "subjects21_description": "This course introduces students to the basics of machine learning, including supervised and unsupervised teaching, modelling and learning algorithms.",
  "subjects22_description": "This course focuses on the theory and applications of deep learning and neural networks, introducing convolutional and recurrent networks.",
  "subjects23_description": "This course teaches techniques to help you analyse data, such as segmentation, classification and clustering.",
  "subjects24_description": "This course focuses on the applications of AI in various industries such as healthcare, automotive and finance.",
  "subjects25_description": "This course deals with ethical issues and legal aspects of artificial intelligence and machine learning, such as personal data protection and discrimination.",
  "subjects26_description": "This course teaches students how to plan and execute online marketing strategies and campaigns, including search engine optimization (SEO), paid advertising (PPC), social media.",
  "subjects27_description": "This course introduces the principles of data-driven marketing and the use of marketing analytics for decision-making and measuring the effectiveness of campaigns.",
  "subjects28_description": "Students can learn to apply personalised marketing strategies and use Customer Relationship Management (CRM) systems to improve customer relationships.",
  "subjects29_description": "This course focuses on specific social media platforms (e.g. Facebook, Instagram, Twitter) and their effective use as part of marketing campaigns.",
  "subjects30_description": "This course introduces new technological trends and innovations in digital marketing, such as artificial intelligence, machine learning and AR/VR applications.",
  "teachers1_content": "Hi! I'm Attila Pataki, and I'm eager to guide you through the exciting world of autonomous vehicles. I am enthusiastically sharing with you my knowledge in Vehicle Operation and Fleet Management and Artificial Intelligence and Machine Learning Vehicle Applications. My aim is to help you develop your knowledge in these areas and prepare you for the transport and technology challenges of the future. Come and let's explore together the new dimensions of vehicle development",
  "teachers2_content": "Hello! I'm Adél Dudás, and we're exploring the exciting world of robotics and software development specifically for vehicles with you. I share my knowledge with you in the subjects Robotics Basics, Robotics Hardware Design and Electronics, and Robot Programming and Control. My goal is to inspire you and help you develop the skills you need in this dynamic field. Come and get involved in the magical world of robotics, where machines come to life through software development and engineering creativity!",
  "teachers3_content": "Hello! I'm Albert Horváth, and I'm touring the fascinating world of Virtual Reality and Augmented Reality with you. And in 3D Modelling and Animation and VR and AR Programming, I'll help you explore the amazing world of digital mapping and programming. My aim is to inspire you and stimulate your creativity as we explore the foundations of virtual and augmented reality together. Come and let's create the digital experiences of the future together!",
  "teachers4_content": "Hi! I'm Attila Borbély, and I'm very happy to be here with you at the IT school. For me, Smart Grids and Communication is not just a subject, it's a passion. I am also dedicated to Smart Home Systems Design and Integration. My goal is to inspire you and help you prepare for the exciting and dynamic world of IT.",
  "teachers5_content": "Hello! I'm Gábor Varga, and we're diving into the fascinating world of machine learning with you. I'll help you explore the mysteries of smart technologies and data analysis in Machine Learning Fundamentals, Deep Learning and Neural Networks, Data Mining and Data Analysis, and Artificial Intelligence Applications. My aim is to inspire you and help you develop the skills you will need in the field of Artificial Intelligence. Come and let's start together to solve the challenges of the future!",
  "teachers6_content": "Hello everyone! I'm Dr. Zsolt Molnár, and I'm here to discuss with you vehicle safety and legal issues in the field of self-driving vehicles. In the Ethics and Legal Aspects of Artificial Intelligence I will help you to explore the responsible and ethical use of AI. My aim is not only to provide you with theoretical knowledge, but also to help you prepare for the real-world challenges you may face in the field of self-driving vehicles and AI. Come and join the discussion that will shape the future of mobility and technological development!",
  "teachers7_content": "Hello! I'm László Nagy, and I'm here with you to explore the exciting world of smart home technology. I will help you discover the latest trends in automation and energy efficiency in the modern home in the Smart Home Technologies Basics, Automated Home Safety and Security, and Smart Home Management and Energy Efficiency courses. My goal is to provide you with knowledge that will help you design and manage smart and sustainable homes. Come and let's shape the future of homes together!",
  "teachers8_content": "Hello! I'm Andrea Kovács, and I'm taking stock of the sophisticated world of online marketing with you. In my courses Online Marketing Strategies and Campaigns, Data Driven Marketing and Analytics, and Personalized Marketing and CRM, I will help you understand the importance of digital marketing tools and data-driven strategies. My goal is to prepare you to plan and execute successful marketing in the digital space. Come and let's explore the dynamic and diverse world of marketing together!",
  "teachers9_content": "Hello! I'm Dr. Gábor Barta, and I'm eager to share with you my knowledge of Artificial Intelligence in Robotics and Robotics Applications and Development. For me, the world of AI and robotics is not just a subject, but a way of life. My goal is to help you explore the mysteries of these exciting fields and inspire you in the world of development and applications.",
  "teachers10_content": "Hello! I'm Éva Mészáros, and we're diving into the exciting field of social media marketing with you. I'll be helping you learn about the latest trends and methods in the Innovation and New Technologies in Digital Marketing courses. My goal is to prepare you for the dynamic world of digital marketing, with a special focus on social media strategies and innovation. Come and let's discover together how to be effective and creative in digital marketing!",
  "teachers11_content": "Hello! I'm Péter Szabó, and together with you we're diving into the applications of virtual and augmented reality in healthcare and education. In VR and AR Applications in Healthcare and Education, I will help you explore the frontiers of technological innovation in these key areas. My goal is to inspire you and help you develop creative and effective solutions in this dynamic and evolving field. Come and let's participate together in the future of healthcare and education!",
  "about": "about us"
  }