{
  "school": "jakab hunor informatikai szakiskola",
  "teacher": "tanárok",
  "news": "hírek",
  "community": "közösség",
  "courses": "képzések",
  "contact": "kapcsolat",
  "default": "alapértelmezett",
  "user": "felhasználó",
  "users": "felhasználók",
  "language": "nyelv",
  "home_page": "kezdőlap",
  "title": "Üdvözlünk iskolánk weboldalán!",
  "page": "oldal",
  "login": "bejelentkezés",
  "logout": "kijelentkezés",
  "register": "regisztráció",
  "account": "fiók",
  "profile": "profil",
  "informatics": "informatika",
  "identifier": "azonosító",
  "type": "típus",
  "administrator": "adminisztrátor",
  "guest": "vendég",
  "vip": "vip",
  "not_verified": "nem ellenőrzött",
  "name": "név",
  "prefix_name": "előtag",
  "first_name": "keresztnév",
  "middle_name": "másodiknév",
  "last_name": "vezetéknév",
  "suffix_name": "utótag",
  "nickname": "becenév",
  "born": "született",
  "gender": "neme",
  "male": "férfi",
  "female": "nő",
  "image": "kép",
  "country": "ország",
  "phone": "telefon",
  "city": "város",
  "postcode": "irányítószám",
  "address": "cím",
  "email": "email",
  "confirmation": "megerősítése",
  "password": "jelszó",
  "password_rule": "6-20 karakter (kis-nagy betűt, és számot tartalmaz)",
  "display_password": "jelszót megjelenít",
  "code": "kód",
  "refresh": "frissít",
  "save": "mentés",
  "cancel": "mégsem",
  "edit": "szerkeszt",
  "forgot_password": "elfelejtette a jelszavát",
  "change_email": "email cím megváltoztatása",
  "change_password": "jelszó módosítása",
  "under_construction": "fejlesztés alatt",
  "gallery": "galéria",
  "slogan": "A jövő szakembereit képezzük",
  "courses1": "Automatizált járművek tervezése és üzemeltetése szak",
  "courses2": "Smart home rendszerek tervezése és üzemeltetése szak",
  "courses3": "Robotikai rendszerek tervezése és üzemeltetése szak",
  "courses4": "Virtuális valóság (VR) és kiterjesztett valóság (AR) fejlesztő szak",
  "courses5": "Mesterséges intelligencia fejlesztése és adatelemzése szak",
  "courses6": "Digitális marketing és személyre szabott marketing szak",
  "courses1_description": "Az Automatizált Járművek Tervezése és Üzemeltetése szakon diákjaink elmélyülhetnek az önvezető járművek tervezésében és fejlesztésében. A program magában foglalja a járműüzemeltetés és karbantartás szakmai aspektusait, valamint korszerű technológiák alkalmazását az autonóm járművek tervezése során. Ez a szak egyedülálló lehetőséget kínál a hallgatóknak, hogy elsajátítsák az innovatív járműtechnológiák tervezésének és üzemeltetésének készségeit a jövő mobilitási ágazatában.",
  "courses2_description": "A Smart Home Rendszerek Tervezése és Üzemeltetése szakon diákjaink olyan tudást szerezhetnek, amely lehetővé teszi számukra, hogy intelligens otthonokat tervezzenek és üzemeltessenek. A program kiterjed az okos otthon rendszerek integrációjára, a biztonságos és hatékony energiafelhasználásra, valamint az otthoni automatizáció tervezésére. Ezen a szakon résztvevő hallgatóink a digitális innovációk iránti szenvedélyüket ötvözhetik azzal a képességgel, hogy a jövő otthonainak tervezésében és fejlesztésében jártas szakemberekké váljanak.",
  "courses3_description": "A Robotikai Rendszerek Tervezése és Üzemeltetése szakon diákjaink a robotikai technológiák mélyebb rétegeibe nyerhetnek bepillantást. A program kiterjed a robotikai rendszerek tervezésére, fejlesztésére és üzemeltetésére, beleértve a hardvertervezést és az elektronikai elemek integrációját. Ezen a szakon résztvevő hallgatók innovatív projekteken keresztül fejleszthetik a robottechnológia iránti szenvedélyüket, és felkészülhetnek a jövő intelligens automatizációs kihívásaira.",
  "courses4_description": "A Virtuális Valóság (VR) és Kiterjesztett Valóság (AR) Fejlesztő szakon diákjaink a digitális élmények teremtésének mestereivé válhatnak. A program célja a VR és AR technológiák elmélyült megértése, beleértve az alkalmazásfejlesztést, 3D modellezést és interaktív élmények tervezését. Ezen a szakon résztvevő hallgatók kreativitásukat ötvözhetik a high-tech világban, és felkészülhetnek a virtuális és kiterjesztett valóság területén rejlő innovációs kihívásokra.",
  "courses5_description": "A Mesterséges Intelligencia Fejlesztése és Adatelemzése szakon diákjaink elmélyedhetnek a mesterséges intelligencia tervezésének és fejlesztésének művészetében. A program kiterjed a gépi tanulás és adatelemzés gyakorlati alkalmazásaira, lehetővé téve a hallgatók számára, hogy valós életbeli problémákra alkalmazzák az MI megoldásokat. Ezen a szakon résztvevő hallgatók olyan eszközöket sajátíthatnak el, amelyek segítségével hatékonyan hozzáférhetnek és kiértékelhetik a nagy adathalmazokat, elősegítve ezzel az intelligens rendszerek fejlesztését.",
  "courses6_description": "A Digitális Marketing és Személyre Szabott Marketing szakon diákjaink mélyreható ismereteket szerezhetnek a digitális marketing terén, ahol a modern online eszközök és stratégiák segítségével építhetik fel a márkákat. A program kiemelten foglalkozik a személyre szabott marketinggel, lehetőséget adva a hallgatóknak az egyedi és célzott üzenetek tervezésére a potenciális ügyfelek számára. Ezen a szakon résztvevő diákok a digitális üzleti világban való hatékony navigációra és az online jelenlét optimalizálására készülnek, miközben elsajátítják a személyre szabott marketing legfrissebb trendjeit és eszközeit.",
  "purpose": "Iskolánk célja, hogy olyan tudást adjunk át a tanulóinknak, amelyek a mai gyorsan változó világnak megfeleljenek. Folyamatosan figyeljük a trendeket és ennek megfelelően alakítjuk, fejlesztjük a képzéseinket.",
  "in_more_detail": "bővebben",
  "course": "szak",
  "back": "vissza",
  "home_title": "Az elmúlt évek legsikeresebb IT iskolája!",
  "homenews": "Legfrissebb hírek:",
  "homenews_1_title": "95% fölött a képzés utáni azonnali elhelyezkedés aránya!",
  "homenews_1_desc" : "Eddig sosem látott sikerekkel zárult az előző tanév, szinte minden diákunk elhelyezkedett a szakmában a képzés végére.",
  "homenews_2_title": "Jakab Hunoros az idei „Szakma legjobbja!“",
  "homenews_2_desc" : "Kovács Kornél nyerte az idei év Szakma legjobbja díjat. Vetélytársait hatalmas fölénnyel győzte le iskolánk diákja.",
  "homenews_3_title": "Örökbefogadtuk Sanyit, aki egy mosómedve a helyi állatkertből",
  "homenews_3_desc" : "Sanyi nagyon barátságos mosómedve, jót szórakozik a tanulóinkkal, amikor meglátogatjuk őt.",
  "homenews_4_title": "Márciusban indul az iskola aulájának felújítása",
  "homenews_4_desc" : "Tavasszal majdnem 2 hétig a főbejáraton való belépés szünetel, iskolánkba lépni a hátsó bejáraton lesz lehetőség a felújítás ideje alatt.",
  "homenews_bottom" : "További híreink hamarosan...",
  "contact_title": "Kérdése van? Írjon nekünk!",
  "contact_message": "Üzenet...",
  "contact_subject": "Tárgy...",
  "contact_email": "Az Ön e-mail címe...",
  "contact_submit": "Küldés!",
  "community_title": "Karriered a legjobb szakemberek kezében van!",
  "community_title_desc": "Kollégáink kiváló szakmai ismerettel, remek oktatási képességekkel állnak rendelkezésedre. Nálunk a siker garantált!",
  "close": "Bezár",
  "community_1": "Tanáraink kulcsfontosságú szerepet játszanak a diákok technológiai fejlődésében és innovációs készségeik fejlesztésében. Az ilyen tanárok rendelkeznek a szaktudás és elkötelezettség kombinációjával, amelyek révén inspirálják és vezetik diákjaikat a digitális világban való hatékony navigációhoz. Ezek a pedagógusok nem csupán az informatikai ismeretek átadásában jeleskednek, hanem azáltal is, hogy ösztönzik a diákok kreativitását és problémamegoldó képességeit, így elősegítve a tudás területén való átfogó fejlődést.",
  "community_2": "Egy kiváló IT tanár rendszerint kimagasló eredményeket ér el a diákjai között. Az ilyen tanárok felismerik, hogy a digitális korszakban a tanulásnak és oktatásnak dinamikusnak kell lennie, és ennek megfelelően alakítják óráikat. Ezáltal sikerül nekik kivívniük diákjaik elismerését és támogatását. Az elért eredmények között szerepelhetnek kimagasló teljesítmények robotikai versenyeken, programozási kihívásokon vagy éppen az általuk segített innovatív projektjeik. Ezek az eredmények nemcsak a tanárok szakmai tudását tükrözik, hanem az általuk tanított diákok tehetségének kibontakoztatását is.",
  "community_3": "Iskolánkban oktató tanáraink nem csupán az osztályteremben nyújt kiemelkedő teljesítményt, hanem a szakmai közösség részeként is hozzájárul a tudományág fejlődéséhez. Az ilyen tanárok gyakran részt vesznek konferenciákon, műhelymunkákon, és aktívan megosztják tapasztalataikat más szakemberekkel. Ezen keresztül hozzájárulnak az oktatás és technológiai fejlődés globális szintű előmozdításához, és inspirációt nyújtanak a következő generáció számára.",
  "comm_tab_title": "Az épülő karriered a lehető legjobb kezekben van!",
  "instructor": "Oktató",
  "subjects1": "Autonóm járművek tervezése és fejlesztése",
  "subjects2": "Robotika és szoftverfejlesztés járművek számára",
  "subjects3": "Járműüzemeltetés és flottakezelés",
  "subjects4": "Mesterséges intelligencia és gépi tanulás járműalkalmazásokban",
  "subjects5": "Járműbiztonság és jogi kérdések az önvezető járművek területén",
  "subjects6": "Okos Otthon Technológiák Alapjai",
  "subjects7": "Okos Hálózatok és Kommunikáció",
  "subjects8": "Okos Otthon Rendszertervezés és Integráció",
  "subjects9": "Automatizált Otthoni Biztonság és Védelem",
  "subjects10": "Okos Házkezelés és Energiahatékonyság",
  "subjects11": "Robotika Alapjai",
  "subjects12": "Robotikai Hardvertervezés és Elektronika",
  "subjects13": "Robotprogramozás és irányítás",
  "subjects14": "Mesterséges Intelligencia a Robotikában",
  "subjects15": "Robotika Alkalmazások és Fejlesztés",
  "subjects16": "Virtuális Valóság és Kiterjesztett Valóság Alapjai",
  "subjects17": "3D Modellalkotás és Animáció",
  "subjects18": "VR és AR Programozás",
  "subjects19": "Felhasználói Élménytervezés VR és AR-ban",
  "subjects20": "VR és AR alkalmazások az Egészségügyben és Oktatásban",
  "subjects21": "Gépi Tanulás Alapjai",
  "subjects22": "Deep Learning és Neurális Hálózatok",
  "subjects23": "Adatbányászat és Adatelemzés",
  "subjects24": "Mesterséges Intelligencia alkalmazások",
  "subjects25": "Mesterséges Intelligencia Etika és Jogi Aspektusai",
  "subjects26": "Online Marketing Stratégiák és Kampányok",
  "subjects27": "Adatvezérelt Marketing és Analitika",
  "subjects28": "Személyre szabott Marketing és CRM",
  "subjects29": "Közösségi Média Marketing",
  "subjects30": "Innováció és Új Technológiák a Digitális Marketingben",
  "subjects1_description": "Ebben a tantárgyban a diákok az önvezető járműtechnológia tervezésének alapelveivel és gyakorlati alkalmazásával ismerkednek meg.",
  "subjects2_description": "Ez a tantárgy olyan készségeket tanít, amelyek segítségével a diákok képesek lesznek a járművek számára szükséges szoftvereket és algoritmusokat tervezni és fejleszteni.",
  "subjects3_description": "Ennek a tantárgynak a keretében a diákok megismerik az önvezető járművek flottájának hatékony üzemeltetését és karbantartását.",
  "subjects4_description": "Ez a tantárgy a gépi tanulás és mesterséges intelligencia alkalmazásait tanítja a járműiparban, például az önvezető autók fejlesztésében.",
  "subjects5_description": "Ennek a tantárgynak a célja a járművek biztonságának és az önvezető járművek jogi aspektusainak megértése és elemzése.",
  "subjects6_description": "Ez a tantárgy bemutatja az okos otthon rendszerek alapjait, beleértve az IoT (Internet of Things) eszközöket, szenzorokat és vezérlőrendszereket.",
  "subjects7_description": "Ennek a tantárgynak a célja az okos otthon eszközök közötti kommunikációs hálózatok tervezése és konfigurálása.",
  "subjects8_description": "Ez a tantárgy a gyakorlati aspektusokra összpontosít, például hogyan tervezzen és integráljon különböző okos otthon eszközöket egy összetett rendszerbe.",
  "subjects9_description": "Ez a tantárgy foglalkozik az otthoni biztonsági rendszerekkel és a hozzájuk kapcsolódó okos megoldásokkal.",
  "subjects10_description": "Ez a tantárgy az okos otthonok energiahatékonyságával és energiagazdálkodásával foglalkozik, bemutatva az energiafelhasználás optimalizálásához használható technológiákat.",
  "subjects11_description": "Ez a tantárgy bevezeti a hallgatókat a robotika alapvető fogalmaiba, történetébe és technológiai alapjaiba.",
  "subjects12_description": "Ez a tantárgy a robotrendszerek hardverkomponenseivel foglalkozik, és megtanítja a hallgatókat robotok tervezésére és építésére.",
  "subjects13_description": "Ez a tantárgy a robotok programozásának és vezérlésének elméleti és gyakorlati aspektusait tárgyalja.",
  "subjects14_description": "Ez a tantárgy bemutatja, hogyan használható a mesterséges intelligencia a robotikában, például a gépi tanulás és a mesterséges neurális hálózatok segítségével.",
  "subjects15_description": "Ez a tantárgy a robotika különböző alkalmazásaival foglalkozik, például az ipari robotokkal, az önjáró járművekkel és a robotika az egészségügyben.",
  "subjects16_description": "Ez a tantárgy a VR és AR technológiák alapvető fogalmaival és működési elveivel foglalkozik, bemutatva azokat a technikákat és eszközöket, amelyeket a fejlesztők használnak ezen a területen.",
  "subjects17_description": "Ez a tantárgy a háromdimenziós modellalkotás és animáció technikáival foglalkozik, amelyek elengedhetetlenek a VR és AR tartalmak létrehozásához.",
  "subjects18_description": "Ez a tantárgy a VR és AR alkalmazások fejlesztésére összpontosít, bemutatva a programozási nyelveket és platformokat, amelyekkel dolgozniuk kell a fejlesztőknek.",
  "subjects19_description": "Ez a tantárgy a felhasználói élmény (UX) tervezésére összpontosít a virtuális valóság és kiterjesztett valóság alkalmazásokban, beleértve az interakciótervezést és a felhasználói felület kialakítását.",
  "subjects20_description": "Ez a tantárgy bemutatja a VR és AR alkalmazásokat az egészségügyi és oktatási területeken, és hogyan lehet ezeket a technológiákat használni oktatási és terápiás célokra.",
  "subjects21_description": "Ez a tantárgy bevezeti a hallgatókat a gépi tanulás alapjaiba, beleértve a felügyelt és felügyeletlen tanítást, a modellalkotást és a tanulási algoritmusokat.",
  "subjects22_description": "Ez a tantárgy a mélytanulás és a neurális hálózatok elméletére és alkalmazásaira összpontosít, bemutatva a konvolúciós és rekurrens hálózatokat.",
  "subjects23_description": "Ez a tantárgy olyan technikákat tanít, amelyek segítenek az adatok elemzésében, mint például a szegmentálás, az osztályozás és a klaszterezés.",
  "subjects24_description": "Ez a tantárgy az AI alkalmazásaira összpontosít különböző iparágakban, például az egészségügyben, az autóiparban és a pénzügyek területén.",
  "subjects25_description": "Ez a tantárgy a mesterséges intelligencia és gépi tanulás etikai kérdéseivel és jogi szempontjaival foglalkozik, például a személyes adatvédelemmel és a diszkriminációval kapcsolatos kérdésekkel.",
  "subjects26_description": "Ez a tantárgy tanítja a hallgatóknak az online marketing stratégiák és kampányok tervezését és végrehajtását, beleértve a keresőoptimalizálást (SEO), a fizetett hirdetéseket (PPC), a közösségi médiát ",
  "subjects27_description": "Ez a tantárgy bemutatja az adatvezérelt marketing alapelveit és a marketinganalitika használatát a döntéshozatalhoz és a kampányok hatékonyságának méréséhez.",
  "subjects28_description": "A hallgatók megtanulhatják a személyre szabott marketing stratégiák alkalmazását, valamint a Customer Relationship Management (CRM) rendszerek használatát az ügyfélkapcsolatok javításához.",
  "subjects29_description": " Ez a tantárgy az egyes közösségi média platformokra (pl. Facebook, Instagram, Twitter) és azok hatékony használatára összpontosít a marketingkampányok részeként.",
  "subjects30_description": "Ez a tantárgy bemutatja az új technológiai trendeket és innovációkat a digitális marketing területén, például a mesterséges intelligenciát, a gépi tanulást és az AR/VR alkalmazásokat.",
  "teachers1_content": "Sziasztok! Pataki Attila vagyok, és lelkesen kalauzolom titeket az autonóm járművek izgalmas világába. A Járműüzemeltetés és flottakezelés, valamint a Mesterséges Intelligencia és gépi tanulás járműalkalmazásokban ismeretanyagot is veletek osztom meg. Célom, hogy segítsem a tudásotokat ezeken a területeken, és felkészítselek titeket a jövő közlekedési és technológiai kihívásaira. Gyertek, és fedezzük fel együtt a járműfejlesztés új dimenzióit!",
  "teachers2_content": "Sziasztok! Dudás Adél vagyok, és veletek fedezzük fel a robotika és szoftverfejlesztés izgalmas világát, kifejezetten járművek számára. A Robotika Alapjai, a Robotikai Hardvertervezés és Elektronika, valamint a Robotprogramozás és irányítás tantárgyakban osztom meg veletek a tudásomat. Célom, hogy inspiráljalak titeket és segítsek kialakítani a szükséges képességeket ezen a dinamikus területen. Gyertek, és vegyetek részt a robotika varázslatos világában, ahol a gépek életre kelnek a szoftverfejlesztés és a mérnöki kreativitás révén!",
  "teachers3_content": "Sziasztok! Horváth Albert vagyok, és veletek járom körbe a Virtuális Valóság és Kiterjesztett Valóság lenyűgöző világát. A 3D Modellalkotás és Animáció, valamint a VR és AR Programozás tantárgyakban pedig segítek nektek megismerni a digitális térképzés és programozás csodálatos területeit. Célom, hogy inspiráljalak titeket és ösztönözzem a kreativitásotokat, miközben együtt fedezzük fel a virtuális és kiterjesztett valóság alapjait. Gyertek, és hozzuk létre együtt a jövő digitális élményeit!",
  "teachers4_content": "Szia! Borbély Attila vagyok, és nagyon örülök, hogy itt lehetek veletek az informatikai szakiskolában. Számomra az Okos Hálózatok és Kommunikáció nem csak tantárgy, hanem szenvedély. Emellett elkötelezett vagyok az Okos Otthon Rendszertervezés és Integráció terén is. Célom, hogy inspiráljalak titeket és segítsek felkészülni az informatika izgalmas és dinamikus világára.",
  "teachers5_content": "Sziasztok! Varga Gábor vagyok, és veletek mélyedünk el a gépi tanulás lenyűgöző világában. A Gépi Tanulás Alapjai, a Deep Learning és Neurális Hálózatok, az Adatbányászat és Adatelemzés, valamint a Mesterséges Intelligencia alkalmazások tantárgyakban segítek nektek felfedezni az intelligens technológiák és adatelemzés rejtelmeit. Célom, hogy inspiráljalak titeket és segítsek kialakítani azokat a képességeket, amelyekre szükség lesz a mesterséges intelligencia területén. Gyertek, és induljunk el együtt a jövő kihívásainak megoldása felé!",
  "teachers6_content": "Halló mindenkinek! Dr. Molnár Zsolt vagyok, és veletek tárgyaljuk meg a járműbiztonság és jogi kérdéseket az önvezető járművek területén. A Mesterséges Intelligencia Etika és Jogi Aspektusai tantárgyakban pedig segítek nektek felfedezni az MI felelős és etikai alkalmazását. Célom, hogy nemcsak elméleti ismereteket adjak át, hanem segítsek felkészülni a valós kihívásokra, amelyekkel az önvezető járművek és mesterséges intelligencia terén találkozhattok. Gyertek, és vegyetek részt a diskurzusban, amely formálja a jövő mobilitását és technológiai fejlődését!",
  "teachers7_content": "Sziasztok! Nagy László vagyok, és veletek járom körbe az okos otthon technológiák izgalmas világát. Az Okos Otthon Technológiák Alapjai, az Automatizált Otthoni Biztonság és Védelem, valamint az Okos Házkezelés és Energiahatékonyság tantárgyakban segítek nektek felfedezni a modern otthonok automatizációjának és energiahatékonyságának legújabb trendjeit. Célom, hogy olyan tudást adjak át, amely segít titeket okos és fenntartható otthonok tervezésében és kezelésében. Gyertek, és együtt alakítsuk ki az otthonok jövőjét!",
  "teachers8_content": "Sziasztok! Kovács Andrea vagyok, és veletek veszem számba az online marketing kifinomult világát. Az Online Marketing Stratégiák és Kampányok, az Adatvezérelt Marketing és Analitika, valamint a Személyre szabott Marketing és CRM tantárgyakban segítek nektek megérteni a digitális marketing eszközök és adatok által vezérelt stratégiák fontosságát. Célom, hogy felkészítselek titeket a sikeres marketing tervezésére és végrehajtására a digitális térben. Gyertek, és fedezzük fel együtt a marketing dinamikus és változatos világát!",
  "teachers9_content": "Helló! Dr. Barta Gábor vagyok, és lelkesen osztom meg veletek a Mesterséges Intelligencia a Robotikában és a Robotika Alkalmazások és Fejlesztés tudásomat. Az MI és robotika világa számomra nemcsak egy tantárgy, hanem életforma. Célom, hogy segítsek nektek felfedezni ezen izgalmas területek rejtelmeit, és inspiráljalak titeket a fejlesztés és alkalmazások világában.",
  "teachers10_content": "Sziasztok! Mészáros Éva vagyok, és veletek mélyedünk el a közösségi média marketing izgalmas területén. Az Innováció és Új Technológiák a Digitális Marketingben tantárgyakban segítek nektek megismerni a legfrissebb trendeket és módszereket. Célom, hogy felkészítselek titeket a digitális marketing dinamikus világára, különös hangsúlyt fektetve a közösségi média stratégiákra és az innovációra. Gyertek, és fedezzük fel együtt, hogyan lehetünk hatékonyak és kreatívak a digitális marketing terén!",
  "teachers11_content": "Sziasztok! Szabó Péter vagyok, és veletek együtt mélyedünk el a virtuális és kiterjesztett valóság alkalmazásaiban az egészségügyben és oktatásban. A VR és AR alkalmazások az Egészségügyben és Oktatásban tantárgyakban segítek nektek felfedezni a technológiai innováció határait ezeken a kulcsfontosságú területeken. Célom, hogy inspiráljalak titeket és segítsek kialakítani a kreatív és hatékony megoldásokat ezen a dinamikus és fejlődő területen. Gyertek, és vegyünk részt együtt a jövő egészségügyi és oktatási fejlesztéseiben!"
}