{
  "school": "jakab hunor informatikai szakiskola",
  "teacher": "tanárok",
  "news": "hírek",
  "community": "közösség",
  "courses": "képzések",
  "contact": "kapcsolat",
  "default": "alapértelmezett",
  "user": "felhasználó",
  "users": "felhasználók",
  "language": "nyelv",
  "home_page": "kezdőlap",
  "title": "Üdvözlünk iskolánk weboldalán!",
  "page": "oldal",
  "login": "bejelentkezés",
  "logout": "kijelentkezés",
  "register": "regisztráció",
  "account": "fiók",
  "profile": "profil",
  "informatics": "informatika",
  "identifier": "azonosító",
  "type": "típus",
  "administrator": "adminisztrátor",
  "guest": "vendég",
  "vip": "vip",
  "not_verified": "nem ellenőrzött",
  "name": "név",
  "prefix_name": "előtag",
  "first_name": "keresztnév",
  "middle_name": "másodiknév",
  "last_name": "vezetéknév",
  "suffix_name": "utótag",
  "nickname": "becenév",
  "born": "született",
  "gender": "neme",
  "male": "férfi",
  "female": "nő",
  "image": "kép",
  "country": "ország",
  "phone": "telefon",
  "city": "város",
  "postcode": "irányítószám",
  "address": "cím",
  "email": "email",
  "confirmation": "megerősítése",
  "password": "jelszó",
  "password_rule": "6-20 karakter (kis-nagy betűt, és számot tartalmaz)",
  "display_password": "jelszót megjelenít",
  "code": "kód",
  "refresh": "frissít",
  "save": "mentés",
  "cancel": "mégsem",
  "edit": "szerkeszt",
  "forgot_password": "elfelejtette a jelszavát",
  "change_email": "email cím megváltoztatása",
  "change_password": "jelszó módosítása",
  "under_construction": "fejlesztés alatt",
  "gallery": "galéria",
  "slogan": "A jövő szakembereit képezzük",
  "training1": "Automatizált járművek tervezése és üzemeltetése szak",
  "training2": "Smart home rendszerek tervezése és üzemeltetése szak",
  "training3": "Robotikai rendszerek tervezése és üzemeltetése szak",
  "training4": "Virtuális valóság (VR) és kiterjesztett valóság (AR) fejlesztő szak",
  "training5": "Mesterséges intelligencia fejlesztése és adatelemzése szak",
  "training6": "Digitális marketing és személyre szabott marketing szak",
  "training1_description": "Az autonóm gépjárművezető rendszerek leglényegesebb tulajdonsága talán éppen az, hogy miképpen kezelik a részlegesen, zavarások mellett érzékelt közlekedési helyzetek többértelműségét és komplexitását. Jan Nagler, Jeroen van den Hoven és Dirk Helbing",
  "training2_description": "Az okos otthon egy logikákra épülő, egymásra hangolt rendszer ahol a rendszerben résztvevő egységek (fűtés, világítás, árnyékolás stb…) összedolgoznak és támogatják egymást. Egy felületről érhető el minden funkció és tetszés szerint öszekapcsolódó automatikák alakíthatóak ki.",
  "training3_description": "Az ember és a robot közötti minél hatékonyabb együttműködés a robotika egyik legfontosabb törekvése. Az emberrel párhuzamosan történő munkavégzés képességével a modern robotikai rendszerek ugyanis a leggyorsabban változó körülményekhez is tudnak alkalmazkodni.",
  "training4_description": "A virtuális valóság létrehozásában óriási szerepe van az úgynevezett nyomkövető rendszereknek, melyek a felhasználó testének, kezeinek, fejének helyzetmeghatározására szükségesek, valamint a tapintási rendszereknek, melyek az erő és nyomás visszacsatolására hivatottak.",
  "training5_description": "A mesterséges intelligencia jelenleg a számítógép-tudomány jelentős ágát képviseli, amely intelligens viselkedéssel, gépi tanulással, és a gépek adaptációjával foglalkozik. Olyan tudományággá vált, amely a valós életbeli problémákra próbál válaszokat adni.",
  "training6_description": "Az digitális marketing célja, hogy az eladónak személyesebb módszerekkel van lehetősége cégének vagy üzletének ismertségét/tudatosságát felépíteni, és ezzel végeredményben egy emberközpontúbb kommunikációt létrehozni.",
  "purpose": "Iskolánk célja, hogy olyan tudást adjunk át a tanulóinknak, amelyek a mai gyorsan változó világnak megfeleljenek. Folyamatosan figyeljük a trendeket és ennek megfelelően alakítjuk, fejlesztjük a képzéseinket.",
  "in_more_detail": "bővebben",
  "course": "szak",
  "back": "vissza",
  "home_title": "Az elmúlt évek legsikeresebb IT iskolája!",
  "homenews": "Legfrissebb hírek:",
  "homenews_1_title": "95% fölött a képzés utáni azonnali elhelyezkedés aránya!",
  "homenews_1_desc" : "Eddig sosem látott sikerekkel zárult az előző tanév, szinte minden diákunk elhelyezkedett a szakmában a képzés végére.",
  "homenews_2_title": "Jakab Hunoros az idei „Szakma legjobbja!“",
  "homenews_2_desc" : "Kovács Kornél nyerte az idei év Szakma legjobbja díjat. Vetélytársait hatalmas fölénnyel győzte le iskolánk diákja.",
  "homenews_3_title": "Örökbefogadtuk Sanyit, aki egy mosómedve a helyi állatkertből",
  "homenews_3_desc" : "Sanyi nagyon barátságos mosómedve, jót szórakozik a tanulóinkkal, amikor meglátogatjuk őt.",
  "homenews_4_title": "Márciusban indul az iskola aulájának felújítása",
  "homenews_4_desc" : "Tavasszal majdnem 2 hétig a főbejáraton való belépés szünetel, iskolánkba lépni a hátsó bejáraton lesz lehetőség a felújítás ideje alatt.",
  "homenews_bottom" : "További híreink hamarosan...",
  "contact_title": "Kérdése van? Írjon nekünk!",
  "contact_message": "Üzenet...",
  "contact_subject": "Tárgy...",
  "contact_email": "Az Ön e-mail címe...",
  "contact_submit": "Küldés!",
  "community_title": "Karriered a legjobb szakemberek kezében van!",
  "community_title_desc": "Kollégáink kiváló szakmai ismerettel, remek oktatási képességekkel állnak rendelkezésedre. Nálunk a siker garantált!",
  "close": "Bezár",
  "community_1": "Tanáraink kulcsfontosságú szerepet játszanak a diákok technológiai fejlődésében és innovációs készségeik fejlesztésében. Az ilyen tanárok rendelkeznek a szaktudás és elkötelezettség kombinációjával, amelyek révén inspirálják és vezetik diákjaikat a digitális világban való hatékony navigációhoz. Ezek a pedagógusok nem csupán az informatikai ismeretek átadásában jeleskednek, hanem azáltal is, hogy ösztönzik a diákok kreativitását és problémamegoldó képességeit, így elősegítve a tudás területén való átfogó fejlődést.",
  "community_2": "Egy kiváló IT tanár rendszerint kimagasló eredményeket ér el a diákjai között. Az ilyen tanárok felismerik, hogy a digitális korszakban a tanulásnak és oktatásnak dinamikusnak kell lennie, és ennek megfelelően alakítják óráikat. Ezáltal sikerül nekik kivívniük diákjaik elismerését és támogatását. Az elért eredmények között szerepelhetnek kimagasló teljesítmények robotikai versenyeken, programozási kihívásokon vagy éppen az általuk segített innovatív projektjeik. Ezek az eredmények nemcsak a tanárok szakmai tudását tükrözik, hanem az általuk tanított diákok tehetségének kibontakoztatását is.",
  "community_3": "Iskolánkban oktató tanáraink nem csupán az osztályteremben nyújt kiemelkedő teljesítményt, hanem a szakmai közösség részeként is hozzájárul a tudományág fejlődéséhez. Az ilyen tanárok gyakran részt vesznek konferenciákon, műhelymunkákon, és aktívan megosztják tapasztalataikat más szakemberekkel. Ezen keresztül hozzájárulnak az oktatás és technológiai fejlődés globális szintű előmozdításához, és inspirációt nyújtanak a következő generáció számára.",
  "comm_tab_title": "Az épülő karriered a lehető legjobb kezekben van!"
}